data/003_heatsink/run001_of2512/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
dimensions      [ 0 0 0 1 0 0 0 ];
internalField   uniform 293.15;
boundaryField
{
    ".*"
    {
        type        calculated;
        value       uniform 293.15;
    }
}
