data/003_heatsink/run001_of2512/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [ 0 1 -1 0 0 0 0 ];
internalField   uniform (0 -0.5 0);
boundaryField
{
    ".*"
    {
        type        calculated;
        value       uniform (0 -0.5 0);
    }
}
