data/003_heatsink/run001_of2512/0/box/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/box";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 293.15;

boundaryField
{
    YMin
    {
        type            inletOutlet;
        value           uniform 293.15;
        inletValue      uniform 293.15;
    }
    ZMax
    {
        type            zeroGradient;
        value           uniform 293.15;
    }
    XMax
    {
        type            zeroGradient;
        value           uniform 293.15;
    }
    YMax
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    XMin
    {
        type            zeroGradient;
        value           uniform 293.15;
    }
    box_to_basis
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293.15;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              none;
        thermalInertia  true;
        kappa           none;
    }
    box_to_heatSource
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293.15;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              none;
        thermalInertia  true;
        kappa           none;
    }
    box_to_heatSink
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293.15;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              none;
        thermalInertia  true;
        kappa           none;
    }
}


// ************************************************************************* //
