data/003_heatsink/run001_of2512/0/box/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/box";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 -0.5 0 );

boundaryField
{
    YMin
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 -0.5 0 );
    }
    ZMax
    {
        type            noSlip;
        value           uniform ( 0 -0.5 0 );
    }
    XMax
    {
        type            noSlip;
        value           uniform ( 0 -0.5 0 );
    }
    YMax
    {
        type            fixedValue;
        value           uniform ( 0 -0.5 0 );
    }
    XMin
    {
        type            noSlip;
        value           uniform ( 0 -0.5 0 );
    }
    box_to_basis
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    box_to_heatSource
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    box_to_heatSink
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
