data/003_heatsink/run001_of2512/0/box/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/box";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    YMin
    {
        type            calculated;
        value           uniform 0;
    }
    ZMax
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    XMax
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    YMax
    {
        type            calculated;
        value           uniform 0;
    }
    XMin
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    box_to_basis
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    box_to_heatSource
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    box_to_heatSink
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
