data/003_heatsink/run001_of2512/0/heatSink/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/heatSink";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 293.15;

boundaryField
{
    heatSink_to_heatSource
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293.15;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        thermalInertia  true;
        kappa           none;
    }
    heatSink_to_box
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293.15;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        thermalInertia  true;
        kappa           none;
    }
}


// ************************************************************************* //
