data/003_heatsink/run001_of2512/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [ 0 2 -2 0 0 0 0 ];
internalField   uniform 0.001;
boundaryField
{
    ".*"
    {
        type        calculated;
        value       uniform 0.001;
    }
}
