data/003_heatsink/run001_of2512/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
dimensions      [ 0 2 -1 0 0 0 0 ];
internalField   uniform 0;
boundaryField
{
    ".*"
    {
        type        calculated;
        value       uniform 0;
    }
}
