data/003_heatsink/run001_of2512/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
dimensions      [ 0 0 -1 0 0 0 0 ];
internalField   uniform 10;
boundaryField
{
    ".*"
    {
        type        calculated;
        value       uniform 10;
    }
}
