data/003_heatsink/run001_of2512/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
dimensions      [ 1 -1 -2 0 0 0 0 ];
internalField   uniform 100000;
boundaryField
{
    ".*"
    {
        type        calculated;
        value       uniform 100000;
    }
}
