data/003_heatsink/run001_of2512/constant/heatSink/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/heatSink/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    heatSink_to_heatSource
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          510;
        startFace       17472;
        sampleMode      nearestPatchFace;
        sampleRegion    heatSource;
        samplePatch     heatSource_to_heatSink;
    }
    heatSink_to_box
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          5818;
        startFace       17982;
        sampleMode      nearestPatchFace;
        sampleRegion    box;
        samplePatch     box_to_heatSink;
    }
)

// ************************************************************************* //
